/**
    2.算法

    2.4 算法的定义
        算法是解决特定问题求解步骤的描述, 在计算机中表现为指令的有限序列, 并且每条指令表示一个或多个操作.

        算法定义中, 提到了指令, 指令能被人或机器等计算装置执行.它可以是计算机指令, 也可以是我们平时的语言文字.
        为了解决某个或某类问题, 需要把指令表示成一定的操作序列, 操作序列包括一组操作, 每一个操作都完成特定的功能, 这就是算法了.

    2.5 算法的特性
        算法具有五个基本特性: 输入, 输出, 有穷性, 确定性和可行性.

        2.5.1 输入输出
            算法具有零个或多个输入.
            算法至少有一个或多个输出.

        2.5.2 有穷性
            有穷性: 指算法在执行有限的步骤之后, 自动结束而不会出现无限循环, 并且每一个步骤在可接受的时间内完成.

        2.5.3 确定性
            确定性: 算法的每一步骤都具有确定的含义, 不会出现二义性.

        2.5.4 可行性
            可行性: 算法的每一步都必须是可行的, 也就是说, 每一步都能够通过执行有限次数完成.

    2.6 算法设计的要求
        2.6.1 正确性
            正确性: 算法的正确性是指算法应该具有输入, 输出和加工处理无歧义性, 能正确反映问题的需求, 能够得到问题的正确答案.

            但是算法的"正确"通常在用法上有很大的差别, 大体分为以下四个层次.
            1. 算法程序没有语法错误.
            2. 算法程序对于合法的输入数据能够产生满足要求的输出结果.
            3. 算法程序对于非法的输入数据得出满足规格说明的结果.
            4. 算法程序对于精心选择的, 甚至刁难的测试数据都有满足要求的输出结果.

        2.6.2 可读性
            可读性: 算法设计的另一目的是为了便于阅读, 理解和交流.

        2.6.3 健壮性
            健壮性: 当输入数据不合法时, 算法也能做出相关处理, 而不是产生异常或莫名其妙的结果.

        2.6.4 时间效率高和存储量低
            设计算法应该尽量时间效率高和存储量低的需求.

    2.7 算法效率的度量方法
        2.7.1 事后统计方法
            事后统计方法: 这种方法主要是通过设计好的测试程序和数据, 利用计算机计时器对不同算法编制的程序的运行时间进行比较, 从而确定算法效率的高低.

 */